# initializing taps and support commands
tap "caskroom/cask"
tap "caskroom/versions"
brew "mas"

# shell essentials
brew "zsh"
brew "tmux"
brew "git"
brew "coreutils"
brew "openssl"
brew "wget"
brew "curl"
brew "tree"
brew "cmake"
brew "yadm"

# tools
brew "prettyping"
brew "htop"
brew "ncdu"
brew "fzf"
brew "the_silver_searcher"
brew "diff-so-fancy"
brew "jq"

# development tools
brew "gcc"
brew "llvm"
brew "php@7.1"
brew "node"
brew "yarn"
brew "python"
brew "python3"
cask "adoptopenjdk/openjdk/adoptopenjdk8"
brew "ant"
brew "maven"
brew "scala"
brew "sbt"
cask "sequel-pro"

# editors
brew "vim"
cask "visual-studio-code"
mas "Xcode", id: 497799835

# system essentials
cask "iterm2"
cask "docker"

